mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/lib/sdk11/components/libraries/bootloader_dfu/dfu_transport_ble.c
#ifdef SPEEDUP_FLASH_WRITES
static void set_local_connection_latency(uint16_t requested_latency)
{
  if (!IS_CONNECTED()) return;

  ble_opt_t opt;
  varclr(&opt);
  opt.gap_opt.local_conn_latency.conn_handle       = m_conn_handle; /**< Connection Handle */
  opt.gap_opt.local_conn_latency.requested_latency = requested_latency;
  opt.gap_opt.local_conn_latency.p_actual_latency =
    NULL; /**< Pointer to storage for the actual local connection latency (can be set to NULL to skip return value). */
  (void) sd_ble_opt_set(BLE_GAP_OPT_LOCAL_CONN_LATENCY, &opt);
}

static void set_slave_latency_disabled(bool disabled)
{
  if (!IS_CONNECTED()) return;

  ble_opt_t opt;
  varclr(&opt);
  opt.gap_opt.slave_latency_disable.conn_handle = m_conn_handle;
  opt.gap_opt.slave_latency_disable.disable     = disabled ? 1 : 0;
  (void) sd_ble_opt_set(BLE_GAP_OPT_SLAVE_LATENCY_DISABLE, &opt);
}

static void prioritize_ble_over_flash_writes(void)
{
  // Local latency 0 only removes the extra events skipped by this bootloader;
  // it does not override slave latency negotiated by the peer. A bonded
  // buttonless handoff can inherit non-zero slave latency from the central, so
  // disable that latency only while firmware DATA is active. Both options are
  // local and best-effort; an older/unsupported stack keeps the usable link.
  set_local_connection_latency(0);
  set_slave_latency_disabled(true);
  m_ble_data_policy_active = true;
}

static void restore_ble_connection_policy(void)
{
  set_local_connection_latency(0);
  set_slave_latency_disabled(false);
  m_ble_data_policy_active = false;
}

static void prioritize_flash_writes_over_ble(void)
{
  // We set the local latency to the maximum possible: That will make FLASH writes faster, as BLE comms will
  //  be delayed (even losing RXd packets, but this is the same as a poor connection and will be handled by
  //  the protocol itself)
  set_slave_latency_disabled(false);
  m_ble_data_policy_active = false;
  set_local_connection_latency(50);
}
#else
static void prioritize_ble_over_flash_writes(void)
{
  m_ble_data_policy_active = true;
}

static void restore_ble_connection_policy(void)
{
  m_ble_data_policy_active = false;
}

static void prioritize_flash_writes_over_ble(void)
{
  m_ble_data_policy_active = false;
}
#endif
/**@brief     Function for handling the callback events from the dfu module.
 *            Callbacks are expected when \ref dfu_data_pkt_handle has been executed.
 *
 * @param[in] packet    Packet type for which this callback is related.
 * @param[in] result    Operation result code. NRF_SUCCESS when a queued operation was successful.
 * @param[in] p_data    Pointer to the data to which the operation is related.
 */
static void dfu_cb_handler(uint32_t packet, uint32_t result, uint8_t * p_data)
{
    switch (packet)
    {
        ble_dfu_resp_val_t resp_val;
        uint32_t           err_code;

        case DATA_PACKET:
            if (result != NRF_SUCCESS)
            {
                // Restore latency to the negotiated one
                restore_ble_connection_policy();

                // Disconnect from peer.
                if (IS_CONNECTED())
                {
                    err_code = sd_ble_gap_disconnect(m_conn_handle,
                                                     BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                    APP_ERROR_CHECK(err_code);
                }
            }
            else
            {
                err_code = hci_mem_pool_rx_consume(p_data);
                APP_ERROR_CHECK(err_code);

                // If the callback matches final data packet received then the peer is notified.
                if (mp_final_packet == p_data)
                {
                    // Restore latency to the negotiated one
                    restore_ble_connection_policy();

                    // Notify the DFU Controller about the success of the procedure.
                    err_code = ble_dfu_response_send(&m_dfu,
                                                     BLE_DFU_RECEIVE_APP_PROCEDURE,
                                                     BLE_DFU_RESP_VAL_SUCCESS);
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        case START_PACKET:
#ifdef SIGNED_FW
        case INIT_PACKET:
#endif
        {
#ifdef SIGNED_FW
            const uint8_t procedure = (packet == INIT_PACKET) ?
                                      BLE_DFU_INIT_PROCEDURE : BLE_DFU_START_PROCEDURE;
#else
            const uint8_t procedure = BLE_DFU_START_PROCEDURE;
#endif

            // Signed INIT success is emitted here only after authenticated
            // flash preparation reaches its completion callback.
            restore_ble_connection_policy();
            resp_val = nrf_err_code_translate(result, procedure);
            err_code = ble_dfu_response_send(&m_dfu, procedure, resp_val);
            APP_ERROR_CHECK(err_code);
            break;
        }

        default:
            // ignore.
            break;
    }
}


/**@brief     Function for notifying a DFU Controller about error conditions in the DFU module.
 *            This function also ensures that an error is translated from nrf_errors to DFU Response
 *            Value.
 *
 * @param[in] p_dfu     DFU Service Structure.
 * @param[in] err_code  Nrf error code that should be translated and send to the DFU Controller.
 */
static void dfu_error_notify(ble_dfu_t * p_dfu, uint32_t err_code)
{
    restore_ble_connection_policy();

    // An error has occurred. Notify the DFU Controller about this error condition.
    // Translate the err_code returned to DFU Response Value.
    ble_dfu_resp_val_t resp_val;

    resp_val = nrf_err_code_translate(err_code, BLE_DFU_RECEIVE_APP_PROCEDURE);

    err_code = ble_dfu_response_send(p_dfu, BLE_DFU_RECEIVE_APP_PROCEDURE, resp_val);
    APP_ERROR_CHECK(err_code);
}


/**@brief     Function for processing start data written by the peer to the DFU Packet
 *            Characteristic.
 *
 * @param[in] p_dfu     DFU Service Structure.
 * @param[in] p_evt     Pointer to the event received from the S110 SoftDevice.
 */
static void start_data_process(ble_dfu_t * p_dfu, ble_dfu_evt_t * p_evt)
{
    uint32_t err_code;

    dfu_start_packet_t  start_packet  = {.dfu_update_mode = m_update_mode};
    dfu_update_packet_t update_packet =
    {
        .packet_type         = START_PACKET,
        .params.start_packet = &start_packet
    };

    uint32_t length = p_evt->evt.ble_dfu_pkt_write.len;

    // Verify that the data is exactly three * four bytes (three words) long.
    if (length != (3 * sizeof(uint32_t)))
    {
        err_code = ble_dfu_response_send(p_dfu,
                                         BLE_DFU_START_PROCEDURE,
                                         BLE_DFU_RESP_VAL_NOT_SUPPORTED);
        APP_ERROR_CHECK(err_code);
    }
    else
    {
        // Extract the size of from the DFU Packet Characteristic.
        uint8_t * p_length_data = p_evt->evt.ble_dfu_pkt_write.p_data;

        start_packet.sd_image_size  = uint32_decode(p_length_data + SD_IMAGE_SIZE_OFFSET);
        start_packet.bl_image_size  = uint32_decode(p_length_data + BL_IMAGE_SIZE_OFFSET);
        start_packet.app_image_size = uint32_decode(p_length_data + APP_IMAGE_SIZE_OFFSET);

        // Prioritize FLASH writes over BLE comms
        prioritize_flash_writes_over_ble();

        err_code = dfu_start_pkt_handle(&update_packet);
        if (err_code != NRF_SUCCESS)
        {
            // Leave the upfront erase phase on failure.
            restore_ble_connection_policy();

            // Translate the err_code returned by the above function to DFU Response Value.
            ble_dfu_resp_val_t resp_val;

            resp_val = nrf_err_code_translate(err_code, BLE_DFU_START_PROCEDURE);
            err_code = ble_dfu_response_send(p_dfu, BLE_DFU_START_PROCEDURE, resp_val);
        }
        else
        {
            // dfu_start_pkt_handle() has validated this sum before it is used
            // to decide when the accumulator contains the final packet.
            m_reported_image_size = start_packet.sd_image_size +
                                    start_packet.bl_image_size +
                                    start_packet.app_image_size;
        }

        APP_ERROR_CHECK(err_code);
    }
}


/**@brief     Function for processing initialization data written by the peer to the DFU Packet
 *            Characteristic.
 *
 * @param[in] p_dfu     DFU Service Structure.
 * @param[in] p_evt     Pointer to the event received from the S110 SoftDevice.
 */
static void init_data_process(ble_dfu_t * p_dfu, ble_dfu_evt_t * p_evt)
{
    uint32_t            err_code;
    dfu_update_packet_t dfu_pkt;

